Repository: msitarzewski/brew-browser
Catalog: native/Sources/BrewBrowserKit/Resources/Localizable.xcstrings
Source language: en
Languages: ru

# activity.linesPerJob.format
source: Keep last %d log lines per job
ru: Хранить последние %d строк лога на задачу

# activity.notifyOnCompletion
source: Notify when jobs complete
ru: Уведомлять о завершении задач

# activity.notifyOnCompletion.help
source: Shows a macOS notification when a long-running brew job finishes.
ru: Показывает уведомление macOS, когда долгая задача brew завершается.

# chrome.donate.help
source: Support brew-browser via GitHub Sponsors
ru: Поддержать brew-browser через GitHub Sponsors

# chrome.donate.menu
source: Sponsor brew-browser…
ru: Поддержать brew-browser…

# icon.source.faviconFrom
source: Favicon from {homepage}
ru: Favicon с {homepage}

# icon.source.homepage
source: homepage
ru: домашняя страница

# icon.source.installedApp
source: installed app
ru: установленное приложение

# icon.source.none
source: none
ru: нет

# enrichment.fetchLatest
source: Fetch latest categories & descriptions
ru: Обновлять категории и описания

# enrichment.fetchLatest.help
source: brew-browser ships with built-in AI categories and descriptions. When enabled, it checks for newer first-party enrichment data and fetches a package description when you open the package detail. Only the viewed package name is sent.
ru: brew-browser поставляется со встроенными ИИ-категориями и описаниями. Если включено, приложение проверяет наличие более свежих данных проекта и получает описание пакета, когда вы открываете его карточку. Отправляется только имя просматриваемого пакета.

# filter.all
source: All
ru: Все

# filter.dependency
source: Dependencies
ru: Зависимости

# filter.manual
source: Manual
ru: Вручную

# filter.outdated
source: Outdated
ru: Есть обновления

# filter.vulnerable
source: Vulnerable
ru: Уязвимые

# github.connectedAs.format
source: GitHub: connected as @%@
ru: GitHub: выполнен вход как @%@

# github.deviceFlowInstructions.format
source: Open %@ and enter this code. It has been copied to your clipboard.
ru: Откройте %@ и введите этот код. Он уже скопирован в буфер обмена.

# github.keychain.help
source: The token is stored in macOS Keychain. Sign-in is optional and uses the minimum scopes needed for stars, watches, and issues.
ru: Токен хранится в macOS Keychain. Вход необязателен и использует минимальные разрешения для звёзд, отслеживания и создания issue в GitHub.

# github.noInstalledHomepages
source: None of your installed packages have a GitHub homepage.
ru: У установленных пакетов нет домашней страницы GitHub.

# github.signIn
source: Sign in
ru: Вход

# github.signIn.help
source: Sign in with GitHub to star, watch, and file package metadata issues from brew-browser.
ru: Войдите в GitHub, чтобы ставить звёзды, отслеживать репозитории и создавать issue в GitHub по метаданным пакетов из brew-browser.

# github.signInWithGitHub
source: Sign in with GitHub
ru: Войти через GitHub

# github.signOut
source: Sign out
ru: Выйти

# github.signedInAs
source: Signed in as
ru: Выполнен вход как

# github.signedInAsToast
source: Signed in as @{username}
ru: Выполнен вход как @{username}

# github.signedInToast
source: Signed in to GitHub
ru: Выполнен вход в GitHub

source: GitHub sign-in denied
ru: Вход в GitHub отклонён

# github.signInExpired
source: Sign-in code expired
ru: Срок действия кода истёк

# github.signInExpiredBody
source: Try again.
ru: Попробуйте ещё раз.

# github.stargazers
source: Stargazers
ru: Звёзды

# github.forks
source: Forks
ru: Форки

# github.licenseMismatchTitle
source: brew reports: {brew} · GitHub reports: {github}
ru: brew сообщает: {brew} · GitHub сообщает: {github}

# github.scopeRequired.title.format
source: %@ needs more access
ru: Нужны дополнительные разрешения: %@

# github.scopeRequired.body.format
source: Needs the "%@" GitHub permission. Click to grant it without signing out.
ru: Не хватает разрешения GitHub «%@». Нажмите, чтобы выдать его без выхода из аккаунта.

# github.yourCode
source: Your code
ru: Ваш код

# brew.status.checking
source: Checking Homebrew…
ru: Проверяем Homebrew…

# brew.status.installed
source: Homebrew is installed.
ru: Homebrew установлен.

# brew.status.notFound
source: brew not found
ru: brew не найден

# brew.status.notFoundOnPath
source: Homebrew not found on PATH.
ru: Homebrew не найден в PATH.

# brew.status.unknown
source: Homebrew status unknown
ru: Статус Homebrew неизвестен

# brew.status.unknownWithError
source: Homebrew status unknown - {error}
ru: Статус Homebrew неизвестен — {error}

# catalog.refresh.noWritableDir
source: Couldn't locate a writable catalog directory.
ru: Не удалось найти доступный для записи каталог.

# catalog.refresh.failed.format
source: Catalog refresh failed: %@
ru: Не удалось обновить каталог: %@

# catalog.refresh.malformedResponse
source: brew.sh returned an unexpected catalog format.
ru: brew.sh вернул каталог в неожиданном формате.

# catalog.refresh.emptyResponse.format
source: brew.sh returned an empty catalog (formulae=%d, casks=%d).
ru: brew.sh вернул пустой каталог (формулы=%d, cask-пакеты=%d).

# catalog.refresh.compression
source: Couldn't compress the refreshed catalog.
ru: Не удалось сжать обновлённый каталог.

# catalog.refresh.offlineBlocked
source: Offline mode is on — catalog refresh is blocked. Disable it in Settings → Network.
ru: Офлайн-режим включён — обновление каталога заблокировано. Отключите его в разделе «Настройки → Сеть».

# catalog.refresh.brewFailed
source: brew failed during refresh (exit {code}).
ru: brew завершился с ошибкой при обновлении каталога (код {code}).

# menu.go
source: Go
ru: Переход

# package.kind.casks
source: Casks
ru: Cask-пакеты

# package.kind.formulae
source: Formulae
ru: Формулы

# package.pinned
source: Pinned
ru: Закреплён

# palette.title.menu
source: Command Palette…
ru: Палитра команд…

# security.brewVulnsInstalled
source: brew-vulns is installed
ru: brew-vulns установлен

# security.brewVulnsMissing.help
source: Vulnerability scanning needs the official brew vulns subcommand.
ru: Для проверки уязвимостей нужна официальная подкоманда brew vulns.

# security.installBrewVulns
source: Install brew-vulns
ru: Установить brew-vulns

# security.offlineSuppressed
source: Offline Mode is on — vulnerability scanning is suppressed.
ru: Офлайн-режим включён — проверка уязвимостей заблокирована.

# security.scanInstalled
source: Scan installed packages for known vulnerabilities
ru: Проверять установленные пакеты на известные уязвимости

# security.scanInstalled.help
source: Opt-in, off by default. Runs the official brew vulns subcommand for installed formulae and stores findings locally.
ru: Опционально, выключено по умолчанию. Запускает официальную подкоманду brew vulns для установленных формул и хранит результаты локально.

# security.viewVulnerablePackages
source: View vulnerable packages →
ru: Показать уязвимые пакеты →

# detail.security.cleanStale
source: No advisories as of the last scan — re-scan to confirm
ru: На момент последней проверки известных уязвимостей нет — проверьте ещё раз для подтверждения

# detail.security.lastScan.format
source: Last scan: %@
ru: Последняя проверка: %@

# detail.security.notScanned.detail
source: Not scanned yet. Scanning checks every installed package — brew vulns can't scan just one.
ru: Проверка ещё не выполнялась. Проверка проходит по всем установленным пакетам: brew vulns не умеет проверять только один пакет.

# detail.security.openAdvisory.format
source: Open advisory: %@
ru: Открыть бюллетень безопасности: %@

# detail.security.patchedIn.format
source: Patched in %@
ru: Исправлено в %@

# detail.security.rescanHelp
source: Runs brew vulns across your whole install — it can't scan a single package
ru: Запускает brew vulns по всей установленной библиотеке; отдельный пакет проверить нельзя

# onboarding.aria
source: Homebrew setup
ru: Настройка Homebrew

# onboarding.title
source: Let's get Homebrew set up
ru: Настроим Homebrew

# onboarding.body.mac
source: brew-browser is a friendly face for Homebrew, the package manager for your Mac. Install it once and your library appears here automatically — no relaunch needed.
ru: brew-browser — удобный интерфейс для Homebrew, пакетного менеджера для Mac. Установите Homebrew один раз, и библиотека появится здесь автоматически — перезапуск не нужен.

# onboarding.body.linux
source: brew-browser is a friendly face for Homebrew, which runs on Linux too. Install it once and your library appears here automatically — no relaunch needed.
ru: brew-browser — удобный интерфейс для Homebrew, который работает и в Linux. Установите Homebrew один раз, и библиотека появится здесь автоматически — перезапуск не нужен.

# onboarding.clt.before
source: Install the Xcode Command Line Tools first: run
ru: Сначала установите Xcode Command Line Tools: выполните

# onboarding.clt.after
source: in Terminal and follow the prompts.
ru: в Терминале и следуйте подсказкам.

# onboarding.linuxDeps.before
source: Install Homebrew's build dependencies first — on Debian/Ubuntu:
ru: Сначала установите зависимости сборки Homebrew. Для Debian/Ubuntu:

# onboarding.linuxDeps.after
source: other distros: see the "Homebrew on Linux" page at docs.brew.sh.
ru: для других дистрибутивов см. страницу "Homebrew on Linux" на docs.brew.sh.

# onboarding.installCopied
source: Install command copied to clipboard
ru: Команда установки скопирована

# onboarding.copyFailed
source: Couldn't copy command
ru: Не удалось скопировать команду

# onboarding.openTerminalFailed
source: Couldn't open Terminal
ru: Не удалось открыть Терминал

# onboarding.commandCopiedFallback
source: The install command was copied instead — paste it into any terminal.
ru: Команда установки скопирована — вставьте её в любой терминал.

# onboarding.openTerminalOrCopyFailed
source: Couldn't open Terminal or copy the command
ru: Не удалось открыть Терминал или скопировать команду

# services.alreadyRunning
source: Already running
ru: Уже запущено

# services.empty.body
source: Install something like postgresql, redis, or nginx and services will show up here.
ru: Установите, например, postgresql, redis или nginx — службы появятся здесь.

# services.empty.title
source: No background services
ru: Фоновых служб нет

# services.loadFailed
source: Couldn't load services
ru: Не удалось загрузить службы

# services.loading
source: Loading brew services…
ru: Загружаем службы brew…

# services.notRunning
source: Not running
ru: Не запущено

# services.restart
source: Restart service
ru: Перезапустить службу

# services.start
source: Start service
ru: Запустить службу

# services.status.error
source: error
ru: ошибка

# services.status.notLoaded
source: not loaded
ru: не загружена

# services.status.running
source: running
ru: запущена

# services.status.scheduled
source: scheduled
ru: запланирована

# services.status.stopped
source: stopped
ru: остановлена

# services.status.unknown
source: unknown
ru: неизвестно

# services.stop
source: Stop service
ru: Остановить службу

# settings.appearance.aiFeatures
source: AI features
ru: Функции ИИ

# settings.appearance.aiFeatures.help
source: When off, only Homebrew's native metadata appears. AI-generated categories and descriptions are hidden.
ru: Если выключено, отображаются только штатные метаданные Homebrew. ИИ-категории и описания скрываются.

# settings.appearance.defaultLanding
source: Default landing
ru: Стартовый раздел

# settings.brew.advanced
source: Advanced
ru: Дополнительно

# settings.brew.analytics
source: Analytics
ru: Аналитика

# settings.brew.analytics.help
source: Homebrew sends anonymous install analytics to formulae.brew.sh by default. This changes Homebrew's own analytics preference.
ru: Homebrew по умолчанию отправляет анонимную аналитику установок на formulae.brew.sh. Этот переключатель меняет собственную настройку аналитики Homebrew.

# settings.brew.autoremove
source: Autoremove
ru: Удалить лишние зависимости

# settings.brew.autoremove.confirmMessage
source: This runs brew autoremove to delete formulae installed only as dependencies and no longer needed by any package.
ru: Будет выполнено brew autoremove: команда удалит формулы, установленные только как зависимости и больше не нужные ни одному пакету.

# settings.brew.autoremove.confirmTitle
source: Remove unused dependencies?
ru: Удалить неиспользуемые зависимости?

# settings.brew.autoremove.failedToRun
source: brew autoremove failed to run
ru: Не удалось запустить brew autoremove

# settings.brew.autoremove.help
source: Runs brew autoremove to remove formulae that were installed only as dependencies and are no longer needed.
ru: Запускает brew autoremove, чтобы удалить формулы, установленные только как зависимости и больше не нужные ни одному пакету.

# settings.brew.autoremoveUnused
source: Autoremove unused dependencies
ru: Удалить неиспользуемые зависимости

# settings.brew.confirmDestructive
source: Confirm before uninstall / zap
ru: Подтверждать удаление и zap-очистку

# settings.brew.confirmDestructive.help
source: Ask for confirmation before irreversible actions: uninstalling a package, zap cleanup, or deleting a Brewfile.
ru: Перед необратимыми действиями (удаление пакета, zap-очистка, удаление Brewfile) приложение запрашивает подтверждение.

# settings.brew.confirmations
source: Confirmations
ru: Подтверждения

# settings.brew.greedyUpgrades
source: Greedy upgrades
ru: Расширенное обновление

# settings.brew.greedyUpgrades.help
source: Include self-updating casks such as Chrome when running brew upgrade --greedy. Off by default.
ru: Включает cask-пакеты с собственным механизмом обновления, например Chrome, при запуске brew upgrade --greedy. По умолчанию выключено.

# settings.brew.sendAnalytics
source: Send Homebrew install analytics
ru: Отправлять аналитику установок Homebrew

# settings.fileUnreadable
source: Settings file is unreadable.
ru: Файл настроек не читается.

# settings.github.showStats
source: Show GitHub stats on package pages
ru: Показывать статистику GitHub на страницах пакетов

# settings.github.showStats.help
source: When signed in, brew-browser checks whether you have starred packages with GitHub homepages.
ru: После входа brew-browser проверяет, какие пакеты с домашними страницами GitHub вы отметили звёздочкой.

# settings.network.caskIconFetching
source: Cask icon fetching
ru: Загрузка иконок cask-пакетов

# settings.network.catalogAutoRefresh
source: Catalog auto-refresh
ru: Автообновление каталога

# settings.network.catalogStaleThreshold.format
source: Show stale catalog banner after %d days
ru: Показывать предупреждение об устаревшем каталоге через %d дней

# settings.network.offlineMode
source: Offline Mode
ru: Офлайн-режим

# settings.network.offlineMode.help
source: Blocks all brew-browser network calls. brew commands you start still run normally.
ru: Блокирует все сетевые запросы brew-browser. Команды brew, которые вы запускаете сами, продолжают работать как обычно.

# settings.network.offlineMode.on
source: Offline Mode is on
ru: Офлайн-режим включён

# settings.network.trendingTtl.format
source: Trending cache TTL: %d minutes
ru: TTL кэша трендов: %d мин.

# settings.offlineToggleLocked
source: Offline Mode is on — this toggle is locked.
ru: Офлайн-режим включён — переключатель заблокирован.

# settings.option.daily
source: Daily
ru: Ежедневно

# settings.option.installedOnly
source: Installed only
ru: Только установленные

# settings.option.off
source: Off
ru: Выкл.

# settings.option.weekly
source: Weekly
ru: Еженедельно

# settings.resetToDefaults
source: Reset to defaults
ru: Сбросить настройки

# settings.section.security
source: Security
ru: Безопасность

# settings.section.updates
source: Updates
ru: Обновления

# table.actions
source: Actions
ru: Действия

# table.name
source: Name
ru: Имя

# table.sortBy
source: Sort by {label}
ru: Сортировать по столбцу «{label}»

# table.sortedAsc
source: Sorted by {label}, ascending. Click to reverse.
ru: Сортировка по столбцу «{label}» по возрастанию. Нажмите, чтобы изменить порядок.

# table.sortedDesc
source: Sorted by {label}, descending. Click to reverse.
ru: Сортировка по столбцу «{label}» по убыванию. Нажмите, чтобы изменить порядок.

# table.status
source: Status
ru: Статус

# table.user
source: User
ru: Пользователь

# dashboard.refresh.brewUpdateFailed
source: brew update finished with errors
ru: brew update завершился с ошибками

# dashboard.refresh.catalogFailed
source: Catalog refresh failed
ru: Не удалось обновить каталог

# dashboard.refresh.failed
source: Refresh failed
ru: Не удалось обновить

# dashboard.refresh.successTitle
source: Refreshed
ru: Обновлено

# dashboard.refresh.successBody
source: brew taps + catalog + installed list all current
ru: tap-репозитории brew, каталог и список установленных пакетов актуальны

# dashboard.doctor.failedToRun
source: brew doctor failed to run
ru: Не удалось запустить brew doctor

# dashboard.upgradeAll.success
source: Upgraded {count} packages
ru: Обновлено пакетов: {count}

# storage.refreshDiskUsage
source: Refresh disk usage
ru: Обновить сведения о месте на диске

# storage.diskProbeFailed
source: Disk probe failed: {error}
ru: Не удалось проверить диск: {error}

# storage.measuringDiskUsage
source: Measuring disk usage… (du -sk on {prefix})
ru: Считаем место на диске… (du -sk для {prefix})

# storage.notPresent
source: not present
ru: нет на диске

# storage.revealInFinder
source: Reveal {path} in Finder
ru: Показать {path} в Finder

# storage.showInFileManager
source: Show {path} in file manager
ru: Показать {path} в файловом менеджере

# storage.revealLabelInFinder
source: Reveal {label} in Finder
ru: Показать «{label}» в Finder

# storage.showLabelInFileManager
source: Show {label} in file manager
ru: Показать «{label}» в файловом менеджере

# storage.pathMissing
source: Path doesn't exist
ru: Путь не существует

source: Resize panel
ru: Изменить размер панели

# resize.dragHint
source: Drag to resize · double-click to reset
ru: Потяните, чтобы изменить размер; двойной щелчок сбрасывает ширину

# theme.cycle
source: Cycle theme
ru: Переключить тему

# theme.label
source: Theme
ru: Тема

# trending.fetchHistory
source: Fetch trending history
ru: Загружать историю трендов

# trending.fetchHistory.help
source: Downloads per-package trend history for sparklines and package detail charts.
ru: Загружает историю установок по пакетам для мини-графиков и графиков в карточке пакета.

# trending.sparklineAria
source: Install trend sparkline
ru: График динамики установок

# trending.error.backend
source: Backend not available: {error}
ru: Бэкенд недоступен: {error}

# trending.error.failed
source: Failed to load trending: {error}
ru: Не удалось загрузить тренды: {error}

# trending.error.network
source: Couldn't reach formulae.brew.sh
ru: Не удалось подключиться к formulae.brew.sh

# updates.autoCheck
source: Auto-check daily
ru: Проверять ежедневно

# updates.autoCheck.help
source: Automatically check for brew-browser updates once a day.
ru: Автоматически проверять обновления brew-browser раз в день.

# updates.available.help
source: Click to open the updater.
ru: Нажмите, чтобы открыть обновление.

# updates.channel
source: Channel
ru: Канал

# updates.channel.label
source: Update channel
ru: Канал обновлений

# updates.channel.stable
source: Stable
ru: Стабильный

# updates.check.help
source: Checks the Sparkle update feed for a newer brew-browser build.
ru: Проверяет ленту Sparkle на наличие новой сборки brew-browser.

# updates.checkForUpdates
source: Check for Updates…
ru: Проверить обновления…

# updates.checkNow
source: Check now
ru: Проверить сейчас

# updates.lastChecked.format
source: Last checked: %@
ru: Последняя проверка: %@

# updates.never
source: Never
ru: Никогда

# updates.noBeta
source: No beta channel in this release.
ru: В этом релизе нет бета-канала.

# updates.offlineBlocked
source: Offline Mode blocks update checks.
ru: Офлайн-режим блокирует проверку обновлений.

# upgrade.choosePackages
source: Choose packages to upgrade
ru: Выберите пакеты для обновления

# upgrade.noOutdated
source: No outdated packages.
ru: Устаревших пакетов нет.

# upgrade.pinned.help
source: Pinned packages are not upgraded by brew. Unpin from the package detail page.
ru: Закреплённые пакеты не обновляются через brew. Снимите закрепление в карточке пакета.

source: deprecated
ru: устарело

# discover.activeFilters
source: Active category filters
ru: Активные фильтры категорий

# discover.catalogFetched
source: Fetched from formulae.brew.sh
ru: Загружено с formulae.brew.sh

# discover.catalogRefreshed
source: Catalog refreshed
ru: Каталог обновлён

# discover.categoryBrowsingHidden
source: Category browsing is hidden because AI features are turned off in Settings → Appearance.
ru: Обзор по категориям скрыт, потому что функции ИИ выключены в «Настройки → Оформление».

# discover.categoryTileAria
source: {category} - {count} packages
ru: {category} — {count} пакетов

# discover.deprecatedDefault
source: Deprecated - may be removed in a future Homebrew update.
ru: Устарело — может быть удалено при одном из будущих обновлений Homebrew.

# discover.deprecatedReason
source: Deprecated: {reason}
ru: Устарело: {reason}

# discover.disabledDefault
source: Disabled - no longer available via Homebrew.
ru: Отключено — больше недоступно через Homebrew.

# discover.disabledReason
source: Disabled: {reason}
ru: Отключено: {reason}

# discover.emptyFilter
source: No packages match this filter.
ru: Под этот фильтр пакеты не подходят.

# discover.groupPackagesLabel
source: Packages in {group}
ru: Пакеты в группе «{group}»

# discover.loadingCategories
source: Loading categories…
ru: Загружаем категории…

# discover.noResults
source: Nothing matches "{query}".
ru: По запросу «{query}» ничего не найдено.

# discover.noResults.body
source: Try a shorter or different term.
ru: Попробуйте более короткий или другой запрос.

# discover.noResultsInCategories
source: No "{query}" results in the selected categories.
ru: По запросу «{query}» нет результатов в выбранных категориях.

# discover.noResultsInCategories.body
source: Try removing a chip or broadening the search term.
ru: Уберите фильтр категории или расширьте запрос.

# discover.packagesInCategory
source: Packages in {category}
ru: Пакеты в категории «{category}»

# discover.removeFilter
source: Remove {category} filter
ru: Убрать фильтр «{category}»

# discover.searchAria
source: Search Homebrew
ru: Поиск по Homebrew

# discover.searchFailed
source: Search failed
ru: Поиск не удался

# discover.searchPlaceholder
source: Search the Homebrew index…
ru: Поиск в индексе Homebrew…

# discover.searchPromptTitle
source: Type a query to search the Homebrew index
ru: Введите запрос для поиска в индексе Homebrew

# discover.staleDismissAria
source: Dismiss catalog staleness banner
ru: Скрыть предупреждение об устаревшем каталоге

# discover.subgroupNote
source: grouped by overlapping category
ru: сгруппировано по пересекающимся категориям

# discover.subgroupsBody
source: Homebrew has no official sub-category data, so this is a co-occurrence grouping: within "{category}", packages are bucketed by the other categories they also belong to. A package with several overlapping categories appears in each bucket. "General {category}" holds packages tagged only "{category}" - it's often the largest group, and this is a grouping aid, not a strict taxonomy.
ru: У Homebrew нет официальных подкатегорий, поэтому это группировка по совместной встречаемости: внутри «{category}» пакеты раскладываются по другим категориям, к которым они тоже относятся. Пакет с несколькими пересекающимися категориями попадает в каждую такую группу. «Общее: {category}» содержит пакеты, отмеченные только категорией «{category}». Это подсказка для навигации, а не строгая таксономия.

# discover.subgroupsLabel
source: About sub-categories
ru: О подкатегориях
